* DONE Implement basic staticmaps support
  DEADLINE: <2009-11-26 Thu> SCHEDULED: <2009-11-23 Mon> CLOSED: [2009-11-26 Thu 16:07]
  - State "DONE"       from "WORKING"    [2009-11-26 Thu 16:07]
  CLOCK: [2009-11-25 Wed 11:40]--[2009-11-25 Wed 14:45] =>  3:05
  CLOCK: [2009-11-24 Tue 14:18]--[2009-11-24 Tue 20:58] =>  6:40
  - State "WORKING"    from "PAUSED"     [2009-11-24 Tue 14:18]
  - State "PAUSED"     from "WORKING"    [2009-11-24 Tue 11:32] \\
    working on json right now
  CLOCK: [2009-11-23 Mon 17:31]--[2009-11-23 Mon 18:37] =>  1:06
  - State "WORKING"    from "TODO"       [2009-11-23 Mon 17:31]
* DONE Implement path support for staticmaps
  DEADLINE: <2009-12-04 Fri> SCHEDULED: <2009-11-26 Thu CLOSED: [2009-12-03 Thu 16:13]
  - State "DONE"       from "WORKING"    [2009-12-03 Thu 16:13]
  CLOCK: [2009-12-02 Wed 15:16]--[2009-12-02 Wed 17:04] =>  1:48
  CLOCK: [2009-11-30 Mon 12:45]--[2009-11-30 Mon 20:15] => 7:30
  CLOCK: [2009-11-30 Mon 09:36]--[2009-11-30 Mon 12:16] =>  2:40
  - State "WORKING"    from "PAUSED"     [2009-11-30 Mon 09:36]
  - State "PAUSED"     from "WORKING"    [2009-11-27 Fri 10:58] \\
    Have to work on minutely tile server performance
  CLOCK: [2009-11-27 Fri 09:37]--[2009-11-27 Fri 10:59] =>  1:22
  - State "WORKING"    from "TODO"       [2009-11-26 Thu 16:15]
  CLOCK: [2009-11-26 Thu 16:15]--[2009-11-26 Thu 18:02] =>  1:47
* DONE Switch to JSON for interprocess communication
 SCHEDULED: <2009-11-23 Mon> DEADLINE: <2009-11-25 Wed> CLOSED: [2009-11-24 Tue 14:17]
 - State "DONE"       from "WORKING"    [2009-11-24 Tue 14:17]
 CLOCK: [2009-11-24 Tue 11:31]--[2009-11-24 Tue 14:17] =>  2:46
  - State "WORKING"    from "TODO"       [2009-11-23 Mon 18:37]
  CLOCK: [2009-11-23 Mon 18:37]--[2009-11-23 Mon 20:35] =>  1:58
* DONE Document staticmaps API
  SCHEDULED: <2009-11-25 Wed> DEADLINE: <2009-11-27 Fri> CLOSED: [2009-11-26 Thu 16:07]
  - State "DONE"       from "WORKING"    [2009-11-26 Thu 16:07]
  - State "WORKING"    from "TODO"       [2009-11-25 Wed 15:26]
  CLOCK: [2009-11-25 Wed 15:26]--[2009-11-25 Wed 16:50] =>  1:24
* DONE Add copyright information
  SCHEDULED: <2009-11-26 Thu> DEADLINE: <2009-11-27 Fri> CLOSED: [2009-11-26 Thu 18:02]
  - State "DONE"       from "TODO"       [2009-11-26 Thu 18:02]
* DONE Look into minutely tile performance issues
  SCHEDULED: <2009-11-27 Fri> DEADLINE: <2009-11-27 Fri> CLOSED: [2009-11-30 Mon 09:36]
  - State "DONE"       from "PAUSED"     [2009-11-30 Mon 09:36]
  - State "PAUSED"     from "WORKING"    [2009-11-27 Fri 16:13] \\
    Currently waiting for TarasZ for cache generation
  - State "WORKING"    from "TODO"       [2009-11-27 Fri 10:59]
  CLOCK: [2009-11-27 Fri 10:59]--[2009-11-27 Fri 16:13] =>  5:14
* DONE Implement expiry tool
  SCHEDULED: <2009-11-30 Mon> DEADLINE: <2009-12-01 Tue> CLOSED: [2009-12-02 Wed 13:49]
  - State "DONE"       from "WORKING"    [2009-12-02 Wed 13:49]
  CLOCK: [2009-12-02 Wed 12:05]--[2009-12-02 Wed 13:49] =>  1:44
  - State "WORKING"    from "TODO"       [2009-12-01 Tue 12:35]
  CLOCK: [2009-12-01 Tue 12:35]--[2009-12-01 Tue 18:58] =>  6:23
* DONE [#A] Write staticmaps API & deployment docs
  SCHEDULED: <2009-12-03 Thu> DEADLINE: <2009-12-03 Thu> CLOSED: [2009-12-03 Thu 16:13]
  - State "DONE"       from "WORKING"    [2009-12-03 Thu 16:13]
  - State "WORKING"    from "TODO"       [2009-12-03 Thu 14:28]
  CLOCK: [2009-12-03 Thu 14:28]--[2009-12-03 Thu 16:13] =>  1:45
* DONE [#A] BBox API for staticmaps
  DEADLINE: <2009-12-14 Mon> SCHEDULED: <2009-12-11 Fri> CLOSED: [2009-12-14 Mon 11:03]
  - State "DONE"       from "WORKING"    [2009-12-14 Mon 11:03]
  - State "WORKING"    from "TODO"       [2009-12-11 Fri 15:38]
  CLOCK: [2009-12-11 Fri 15:38]--[2009-12-14 Mon 11:03] => 67:25
* DONE [#A] Custom markers trough URL
  DEADLINE: <2010-01-26 Tue> SCHEDULED: <2010-01-11 Mon> CLOSED: [2010-01-27 Wed 12:28]
  - State "DONE"       [2010-01-27 Wed 12:28]
  - State "PAUSED"     [2010-01-22 Fri 14:40] \\
    In testing
  CLOCK: [2010-01-19 Tue 17:39]--[2010-01-19 Tue 17:39] =>  0:00
  - State "WORKING"    from "TODO"       [2010-01-13 Wed 16:57]
* DONE [#A] Custom markers through additional API
  DEADLINE: <2010-01-26 Tue> SCHEDULED: <2010-01-14 Thu> CLOSED: [2010-01-27 Wed 12:28]
  - State "DONE"       [2010-01-27 Wed 12:28]
  - State "PAUSED"     [2010-01-22 Fri 14:43] \\
    In testing
  CLOCK: [2010-01-21 Thu 09:34]--[2010-01-21 Thu 16:33] =>  6:59
  CLOCK: [2010-01-20 Wed 10:56]--[2010-01-20 Wed 18:33] =>  7:37
  CLOCK: [2010-01-19 Tue 11:48]--[2010-01-19 Tue 17:39] =>  5:51
  CLOCK: [2010-01-19 Tue 10:47]--[2010-01-19 Tue 11:36] =>  0:49
  - State "WORKING"    from "WORKING"    [2010-01-19 Tue 10:47]
  CLOCK: [2010-01-13 Wed 16:57]--[2010-01-13 Wed 19:19] =>  2:22
  - State "WORKING"    from "TODO"       [2010-01-13 Wed 16:56]
* TODO [#B] POST support
* DONE [#A] Documentation for Staticmaps Jan'2010 release
  DEADLINE: <2010-01-26 Tue> SCHEDULED: <2010-01-14 Thu> CLOSED: [2010-01-26 Tue 17:21]
  - State "DONE"       [2010-01-26 Tue 17:21]
  :CLOCK:
  CLOCK: [2010-01-26 Tue 10:10]--[2010-01-26 Tue 17:21] =>  7:11
  CLOCK: [2010-01-22 Fri 14:44]--[2010-01-26 Tue 09:29] => 90:45
  - State "WORKING"    [2010-01-22 Fri 14:43]
    :END:
  - State "PAUSED"     [2010-01-22 Fri 14:40] \\
    In testing
  - State "WORKING"    from "TODO"       [2010-01-19 Tue 10:47]
